Tekla Open API Reference for Tekla Structures 2025
DateTimeConstantFilterExpression Constructor (IEnumerable<DateTime>)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTimeConstantFilterExpression(
	IEnumerable<DateTime> Values
)
Public Sub New (
	Values As IEnumerable(Of DateTime)
)
Parameters
Values
Type: System.Collections.Generic.IEnumerable<DateTime>
The values to represent.
See Also
Reference
DateTimeConstantFilterExpression Class
DateTimeConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace